src/linux-font-render.org
#+TITLE: Linux下字体渲染的优化

* 生存策略

** 当前之怪现状

现在对于Linux下的字体渲染，感觉有几种（比较主流的）论调：

 - 矢量字体渲染技术不行；
 - 开源字体设计不行（于是就有人把「微软雅黑」放到Linux上、造成极为地狱的渲染效果，甚至2024年了还在用点阵字体[fn::我不是不能接受点阵字体什么的，只是觉得完全没这个必要。]）；
 - Linux没有图形界面的美观需求，于是不关心字体渲染。

可以说极为难崩。

2024年了，经过非常少的配置，7px大小的中文矢量字体在我的2K屏幕上轮廓依然锐利；而且是在我完全不使用字体微调的基础上（我极其厌恶扭曲了轮廓的字体）。靠（专利过期后默认开启的）次像素渲染和LCD滤镜善后加上抗锯齿足矣。

