cnt/linux-font-render.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-10-13 Sun 18:31 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux下字体渲染的优化</title>
<meta name="author" content="RadioNoiseE" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../res/style.css"/>
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Linux下字体渲染的优化</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3e7b71a">1. 生存策略</a>
<ul>
<li><a href="#org7e9f5a9">1.1. 当前之怪现状</a></li>
<li><a href="#org2e89863">1.2. 关于FontConfig</a></li>
</ul>
</li>
<li><a href="#orgcc35665">2. 实践</a>
<ul>
<li><a href="#org7bf71dd">2.1. 字体族配置</a></li>
<li><a href="#orgd117d72">2.2. 启用对应预设</a></li>
</ul>
</li>
<li><a href="#orgc716d94">3. 最后</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org3e7b71a" class="outline-2">
<h2 id="org3e7b71a"><span class="section-number-2">1.</span> 生存策略</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7e9f5a9" class="outline-3">
<h3 id="org7e9f5a9"><span class="section-number-3">1.1.</span> 当前之怪现状</h3>
<div class="outline-text-3" id="text-1-1">
<p>
现在对于Linux下的字体渲染，感觉有几种（比较主流的）论调：
</p>

<ul class="org-ul">
<li>矢量字体渲染技术不行；</li>
<li>开源字体设计不行（于是就有人把「微软雅黑」放到Linux上、造成极为地狱的渲染效果，甚至2024年了还在用点阵字体<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>）；</li>
<li>Linux没有图形界面的美观需求，于是不关心字体渲染。</li>
</ul>

<p>
可以说极为难崩。
</p>

<p>
2024年了，经过非常少的配置，7px大小的中文矢量字体在我的2K屏幕上轮廓依然锐利；而且是在我完全不使用字体微调的基础上（我极其厌恶扭曲了轮廓的字体）。靠（专利过期后默认开启的）次像素渲染和LCD滤镜善后加上抗锯齿足矣。
</p>
</div>
</div>
