cnt/linux-font-render.html

<div id="outline-container-org2e89863" class="outline-3">
<h3 id="org2e89863"><span class="section-number-3">1.2.</span> 关于FontConfig</h3>
<div class="outline-text-3" id="text-1-2">
<p>
如果你愿意去找一找，可以看到互联网上有一些使用FontConfig的教程。他们大多都忽略了一个较好的实践——使用预设。于是他们需要重新实现：
</p>

<ul class="org-ul">
<li>根据简中／繁中／日文等语言选取对应的字体获得正确的字形；</li>
<li>根据语境选取正确的引号<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>；</li>
<li>渲染相关的事务。</li>
</ul>

<p>
但实际上，FontConfig是有对应预设的，比如对于我系统上安装的字体，有：
</p>

<pre class="example">
Available fontconfig .conf files (* is enabled):
  [1]   05-reset-dirs-sample.conf
  [2]   09-autohint-if-no-hinting.conf
  [3]   10-autohint.conf
  [4]   10-hinting-full.conf
  [5]   10-hinting-medium.conf
  [6]   10-hinting-none.conf *
  [7]   10-hinting-slight.conf
  [8]   10-no-antialias.conf
  [9]   10-scale-bitmap-fonts.conf *
  [10]  10-sub-pixel-bgr.conf
  [11]  10-sub-pixel-none.conf
  [12]  10-sub-pixel-rgb.conf
  [13]  10-sub-pixel-vbgr.conf
  [14]  10-sub-pixel-vrgb.conf *
  [15]  10-unhinted.conf
  [16]  10-yes-antialias.conf *
  [17]  11-lcdfilter-default.conf
  [18]  11-lcdfilter-legacy.conf
  [19]  11-lcdfilter-light.conf *
  [20]  11-lcdfilter-none.conf
  [21]  20-unhint-small-vera.conf *
  [22]  25-unhint-nonlatin.conf
  [23]  30-metric-aliases.conf *
  [24]  35-lang-normalize.conf *
  [25]  40-nonlatin.conf *
  [26]  45-generic.conf *
  [27]  45-latin.conf *
  [28]  48-spacing.conf *
  [29]  49-sansserif.conf *
  [30]  50-user.conf *
  [31]  51-local.conf *
  [32]  60-generic.conf *
  [33]  60-latin.conf *
  [34]  60-liberation.conf *
  [35]  61-urw-bookman.conf
  [36]  61-urw-c059.conf
  [37]  61-urw-d050000l.conf
  [38]  61-urw-fallback-backwards.conf
  [39]  61-urw-fallback-generics.conf
  [40]  61-urw-fallback-specifics.conf
  [41]  61-urw-gothic.conf
  [42]  61-urw-nimbus-mono-ps.conf
  [43]  61-urw-nimbus-roman.conf
  [44]  61-urw-nimbus-sans.conf
  [45]  61-urw-p052.conf
  [46]  61-urw-standard-symbols-ps.conf
  [47]  61-urw-z003.conf
  [48]  63-source-code-pro.conf
  [49]  65-fonts-persian.conf *
  [50]  65-khmer.conf
  [51]  65-nonlatin.conf *
  [52]  66-iosevka.conf
  [53]  66-iosevka-curly.conf
  [54]  66-iosevka-curly-slab.conf *
  [55]  66-iosevka-slab.conf
  [56]  69-unifont.conf *
  [57]  70-no-bitmaps.conf
  [58]  70-noto-cjk.conf *
  [59]  70-yes-bitmaps.conf
  [60]  80-delicious.conf *
  [61]  90-synthetic.conf *
</pre>

<p>
你只需要启用你需要的就好了。（<code>eselect</code>是Gentoo的好东西，其他发行版只需要链接<code>conf.avail</code>路径下的预设即可，见下文）。
</p>

<p>
所以，实际上你需要写的只有这些：
</p>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #655370; background-color: #fbf8ef;">&lt;?</span><span style="color: #3a81c3; font-weight: bold;">xml</span> <span style="color: #da8b55; font-style: italic;">version</span><span style="color: #da8b55; font-weight: bold;">=</span><span style="color: #da8b55; background-color: #fbf8ef;">"</span><span style="color: #da8b55;">1.0</span><span style="color: #da8b55; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">?&gt;</span>
<span style="color: #655370; background-color: #fbf8ef;">&lt;!</span><span style="color: #3a81c3; font-weight: bold;">DOCTYPE</span> <span style="color: #ba2f59; font-weight: bold;">fontconfig</span> <span style="color: #3a81c3; font-weight: bold;">SYSTEM</span> <span style="color: #655370; background-color: #fbf8ef;">"</span>fonts.dtd<span style="color: #655370; background-color: #fbf8ef;">"&gt;</span>
<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">fontconfig</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">alias</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>sans-serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">prefer</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Liberation Sans<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Sans CJK SC<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">prefer</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">default</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Apple Symbol<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">default</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">alias</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">alias</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">prefer</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Liberation Serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Serif CJK SC<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">prefer</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">default</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Apple Symbol<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">default</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">alias</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">alias</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>monospace<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">prefer</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Iosevka Curly Slab<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Sans CJK SC<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">prefer</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">default</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Apple Symbol<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">default</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">alias</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">fontconfig</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
</pre>
</div>

<p>
也就是说只需指定三个字体族的偏好字体即可。
</p>
</div>
</div>
</div>
