src/linux-font-render.org
* 实践

** 字体族配置

这一步极为简单，只需要创建配置文件~/etc/fonts/local.conf~并按格式：

#+BEGIN_SRC xml
  <?xml version="1.0"?>
  <!DOCTYPE fontconfig SYSTEM "fonts.dtd">
  <fontconfig>
    <alias>
      <family>sans-serif</family>
      <prefer>
        <family>FSS1</family>
        <family>FSS2</family>
      </prefer>
      <default>
        <family>FSSB</family>
      </default>
    </alias>
    <alias>
      <family>serif</family>
      <prefer>
        <family>FSF1</family>
        <family>FSF2</family>
      </prefer>
      <default>
        <family>FSFB</family>
      </default>
    </alias>
    <alias>
      <family>monospace</family>
      <prefer>
        <family>FMS1</family>
        <family>FMS2</family>
      </prefer>
      <default>
        <family>FMSB</family>
      </default>
    </alias>
  </fontconfig>
#+END_SRC

写入你喜欢的字体即可，不需要什么~binding="strong"~。注意~prefer~里按喜好程度填，~default~里填回滚字体，不需要管什么「中文环境下引号全宽所以中文字体是写在西文字体前面还是后面」这种问题。

顺便，该~local.conf~文件生效需要启用预设~51-local.conf~，见下。

