cnt/linux-font-render.html

<div id="outline-container-orgcc35665" class="outline-2">
<h2 id="orgcc35665"><span class="section-number-2">2.</span> 实践</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7bf71dd" class="outline-3">
<h3 id="org7bf71dd"><span class="section-number-3">2.1.</span> 字体族配置</h3>
<div class="outline-text-3" id="text-2-1">
<p>
这一步极为简单，只需要创建配置文件<code>/etc/fonts/local.conf</code>并按格式：
</p>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #655370; background-color: #fbf8ef;">&lt;?</span><span style="color: #3a81c3; font-weight: bold;">xml</span> <span style="color: #da8b55; font-style: italic;">version</span><span style="color: #da8b55; font-weight: bold;">=</span><span style="color: #da8b55; background-color: #fbf8ef;">"</span><span style="color: #da8b55;">1.0</span><span style="color: #da8b55; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">?&gt;</span>
<span style="color: #655370; background-color: #fbf8ef;">&lt;!</span><span style="color: #3a81c3; font-weight: bold;">DOCTYPE</span> <span style="color: #ba2f59; font-weight: bold;">fontconfig</span> <span style="color: #3a81c3; font-weight: bold;">SYSTEM</span> <span style="color: #655370; background-color: #fbf8ef;">"</span>fonts.dtd<span style="color: #655370; background-color: #fbf8ef;">"&gt;</span>
<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">fontconfig</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">alias</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>sans-serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">prefer</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>FSS1<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>FSS2<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">prefer</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">default</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>FSSB<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">default</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">alias</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">alias</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">prefer</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>FSF1<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>FSF2<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">prefer</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">default</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>FSFB<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">default</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">alias</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">alias</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>monospace<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">prefer</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>FMS1<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>FMS2<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">prefer</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">default</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>FMSB<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">family</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">default</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">alias</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">fontconfig</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
</pre>
</div>

<p>
写入你喜欢的字体即可，不需要什么<code>binding="strong"</code>。注意<code>prefer</code>里按喜好程度填，<code>default</code>里填回滚字体，不需要管什么「中文环境下引号全宽所以中文字体是写在西文字体前面还是后面」这种问题。
</p>

<p>
顺便，该<code>local.conf</code>文件生效需要启用预设<code>51-local.conf</code>，见下。
</p>
</div>
</div>
