src/linux-font-render.org
** 启用对应预设

请确保主要字体（比如我使用的思源系列）是用包管理器安装的，否则可能会缺少对应的预设文件需要你想办法解决。

在Gentoo上可以使用~eselect~，其他发行版只需要使用：

#+BEGIN_SRC shell
  ln -s /usr/share/fontconfig/conf.avail/0-example-config.conf $XDG_CONFIG_HOME/fontconfig/conf.d
#+END_SRC

预设主要分两类，渲染相关的和语言环境下字体选择相关的：

 - 渲染相关的有字体微调、抗锯齿（默认启用）和次像素渲染（其字节码解释器是默认打开的）。其中字体微调风格视你的喜好选择~hintnone~、~hintslight~、~hintmedium~还是~hintfull~。次像素渲染则根据你的显示屏选择像素排布是RGB、BGR、V-RGB还是V-BGR，可以参考[[http://www.lagom.nl/lcd-test/subpixel.php][Subpixel layout - Lagom LCD test]]网站；滤镜也是根据你的喜好选择。预设文件有这些：

   #+BEGIN_SRC
     [2]   09-autohint-if-no-hinting.conf
     [3]   10-autohint.conf
     [4]   10-hinting-full.conf
     [5]   10-hinting-medium.conf
     [6]   10-hinting-none.conf *
     [7]   10-hinting-slight.conf
     [8]   10-no-antialias.conf
     [9]   10-scale-bitmap-fonts.conf *
     [10]  10-sub-pixel-bgr.conf
     [11]  10-sub-pixel-none.conf
     [12]  10-sub-pixel-rgb.conf
     [13]  10-sub-pixel-vbgr.conf
     [14]  10-sub-pixel-vrgb.conf *
     [15]  10-unhinted.conf
     [16]  10-yes-antialias.conf *
     [17]  11-lcdfilter-default.conf *
     [18]  11-lcdfilter-legacy.conf
     [19]  11-lcdfilter-light.conf
     [20]  20-unhint-small-vera.conf *
     [21]  25-unhint-nonlatin.conf
   #+END_SRC

 - 语言环境下的预设文件有：

   #+BEGIN_SRC
     [23]  35-lang-normalize.conf *
     [24]  40-nonlatin.conf *
     [25]  45-generic.conf *
     [26]  45-latin.conf *
     [27]  48-spacing.conf *
     [28]  49-sansserif.conf *
     [50]  65-nonlatin.conf *
   #+END_SRC

 - 随字体如NotoCJK、Iosevka等分发的预设文件比如：

   #+BEGIN_SRC
     [51]  66-iosevka.conf
     [52]  66-iosevka-curly.conf
     [53]  66-iosevka-curly-slab.conf *
     [54]  66-iosevka-slab.conf
     [57]  70-noto-cjk.conf *
   #+END_SRC

   其中~noto-cjk.conf~提供了根据~lang-normalize.conf~决定使用何种字体的特性：

   #+BEGIN_SRC xml
     <?xml version="1.0"?>
     <!DOCTYPE fontconfig SYSTEM "fonts.dtd">
     <fontconfig>
       <match target="pattern">
         <test name="lang">
           <string>ja</string>
         </test>
         <test name="family">
           <string>serif</string>
         </test>
         <edit name="family" mode="prepend">
           <string>Noto Serif CJK JP</string>
         </edit>
       </match>
       <match target="pattern">
         <test name="lang">
           <string>ko</string>
         </test>
         <test name="family">
           <string>serif</string>
         </test>
         <edit name="family" mode="prepend">
           <string>Noto Serif CJK KR</string>
         </edit>
       </match>
       <match target="pattern">
         <test name="lang">
           <string>zh-cn</string>
         </test>
         <test name="family">
           <string>serif</string>
         </test>
         <edit name="family" mode="prepend">
           <string>Noto Serif CJK SC</string>
         </edit>
       </match>
       <match target="pattern">
         <test name="lang">
           <string>zh-tw</string>
         </test>
         <test name="family">
           <string>serif</string>
         </test>
         <edit name="family" mode="prepend">
           <string>Noto Serif CJK TC</string>
         </edit>
       </match>
       <match target="pattern">
         <test name="lang">
           <string>ja</string>
         </test>
         <test name="family">
           <string>sans-serif</string>
         </test>
         <edit name="family" mode="prepend">
           <string>Noto Sans CJK JP</string>
         </edit>
       </match>
       <match target="pattern">
         <test name="lang">
           <string>ko</string>
         </test>
         <test name="family">
           <string>sans-serif</string>
         </test>
         <edit name="family" mode="prepend">
           <string>Noto Sans CJK KR</string>
         </edit>
       </match>
       <match target="pattern">
         <test name="lang">
           <string>zh-cn</string>
         </test>
         <test name="family">
           <string>sans-serif</string>
         </test>
         <edit name="family" mode="prepend">
           <string>Noto Sans CJK SC</string>
         </edit>
       </match>
       <match target="pattern">
         <test name="lang">
           <string>zh-tw</string>
         </test>
         <test name="family">
           <string>sans-serif</string>
         </test>
         <edit name="family" mode="prepend">
           <string>Noto Sans CJK TC</string>
         </edit>
       </match>
       <match target="pattern">
         <test name="lang">
           <string>ja</string>
         </test>
         <test name="family">
           <string>monospace</string>
         </test>
         <edit name="family" mode="prepend">
           <string>Noto Sans Mono CJK JP</string>
         </edit>
       </match>
       <match target="pattern">
         <test name="lang">
           <string>ko</string>
         </test>
         <test name="family">
           <string>monospace</string>
         </test>
         <edit name="family" mode="prepend">
           <string>Noto Sans Mono CJK KR</string>
         </edit>
       </match>
       <match target="pattern">
         <test name="lang">
           <string>zh-cn</string>
         </test>
         <test name="family">
           <string>monospace</string>
         </test>
         <edit name="family" mode="prepend">
           <string>Noto Sans Mono CJK SC</string>
         </edit>
       </match>
       <match target="pattern">
         <test name="lang">
           <string>zh-tw</string>
         </test>
         <test name="family">
           <string>monospace</string>
         </test>
         <edit name="family" mode="prepend">
           <string>Noto Sans Mono CJK TC</string>
         </edit>
       </match>
     </fontconfig>
   #+END_SRC

选取预设文件的时候看一下文件注释和内容去确定它是干什么的就好。我的感觉是很多预设都帮你选好了，你只需要看着添加一些／取消选择一些就好。

