cnt/linux-font-render.html

<div id="outline-container-orgd117d72" class="outline-3">
<h3 id="orgd117d72"><span class="section-number-3">2.2.</span> 启用对应预设</h3>
<div class="outline-text-3" id="text-2-2">
<p>
请确保主要字体（比如我使用的思源系列）是用包管理器安装的，否则可能会缺少对应的预设文件需要你想办法解决。
</p>

<p>
在Gentoo上可以使用<code>eselect</code>，其他发行版只需要使用：
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; font-weight: bold;">ln</span> <span style="color: #4e3163;">-s</span> /usr/share/fontconfig/conf.avail/0-example-config.conf <span style="color: #3a81c3; font-weight: bold;">$</span><span style="color: #4e3163; font-style: italic;">XDG_CONFIG_HOME</span>/fontconfig/conf.d
</pre>
</div>

<p>
预设主要分两类，渲染相关的和语言环境下字体选择相关的：
</p>

<ul class="org-ul">
<li><p>
渲染相关的有字体微调、抗锯齿（默认启用）和次像素渲染（其字节码解释器是默认打开的）。其中字体微调风格视你的喜好选择<code>hintnone</code>、<code>hintslight</code>、<code>hintmedium</code>还是<code>hintfull</code>。次像素渲染则根据你的显示屏选择像素排布是RGB、BGR、V-RGB还是V-BGR，可以参考<a href="http://www.lagom.nl/lcd-test/subpixel.php">Subpixel layout - Lagom LCD test</a>网站；滤镜也是根据你的喜好选择。预设文件有这些：
</p>

<pre class="example">
[2]   09-autohint-if-no-hinting.conf
[3]   10-autohint.conf
[4]   10-hinting-full.conf
[5]   10-hinting-medium.conf
[6]   10-hinting-none.conf *
[7]   10-hinting-slight.conf
[8]   10-no-antialias.conf
[9]   10-scale-bitmap-fonts.conf *
[10]  10-sub-pixel-bgr.conf
[11]  10-sub-pixel-none.conf
[12]  10-sub-pixel-rgb.conf
[13]  10-sub-pixel-vbgr.conf
[14]  10-sub-pixel-vrgb.conf *
[15]  10-unhinted.conf
[16]  10-yes-antialias.conf *
[17]  11-lcdfilter-default.conf *
[18]  11-lcdfilter-legacy.conf
[19]  11-lcdfilter-light.conf
[20]  20-unhint-small-vera.conf *
[21]  25-unhint-nonlatin.conf
</pre></li>

<li><p>
语言环境下的预设文件有：
</p>

<pre class="example">
[23]  35-lang-normalize.conf *
[24]  40-nonlatin.conf *
[25]  45-generic.conf *
[26]  45-latin.conf *
[27]  48-spacing.conf *
[28]  49-sansserif.conf *
[50]  65-nonlatin.conf *
</pre></li>

<li><p>
随字体如NotoCJK、Iosevka等分发的预设文件比如：
</p>

<pre class="example">
[51]  66-iosevka.conf
[52]  66-iosevka-curly.conf
[53]  66-iosevka-curly-slab.conf *
[54]  66-iosevka-slab.conf
[57]  70-noto-cjk.conf *
</pre>

<p>
其中<code>noto-cjk.conf</code>提供了根据<code>lang-normalize.conf</code>决定使用何种字体的特性：
</p>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #655370; background-color: #fbf8ef;">&lt;?</span><span style="color: #3a81c3; font-weight: bold;">xml</span> <span style="color: #da8b55; font-style: italic;">version</span><span style="color: #da8b55; font-weight: bold;">=</span><span style="color: #da8b55; background-color: #fbf8ef;">"</span><span style="color: #da8b55;">1.0</span><span style="color: #da8b55; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">?&gt;</span>
<span style="color: #655370; background-color: #fbf8ef;">&lt;!</span><span style="color: #3a81c3; font-weight: bold;">DOCTYPE</span> <span style="color: #ba2f59; font-weight: bold;">fontconfig</span> <span style="color: #3a81c3; font-weight: bold;">SYSTEM</span> <span style="color: #655370; background-color: #fbf8ef;">"</span>fonts.dtd<span style="color: #655370; background-color: #fbf8ef;">"&gt;</span>
<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">fontconfig</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">match</span> <span style="color: #715ab1; font-style: italic;">target</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">pattern</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">lang</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>ja<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">edit</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span> <span style="color: #715ab1; font-style: italic;">mode</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">prepend</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Serif CJK JP<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">edit</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">match</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">match</span> <span style="color: #715ab1; font-style: italic;">target</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">pattern</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">lang</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>ko<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">edit</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span> <span style="color: #715ab1; font-style: italic;">mode</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">prepend</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Serif CJK KR<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">edit</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">match</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">match</span> <span style="color: #715ab1; font-style: italic;">target</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">pattern</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">lang</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>zh-cn<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">edit</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span> <span style="color: #715ab1; font-style: italic;">mode</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">prepend</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Serif CJK SC<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">edit</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">match</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">match</span> <span style="color: #715ab1; font-style: italic;">target</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">pattern</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">lang</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>zh-tw<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">edit</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span> <span style="color: #715ab1; font-style: italic;">mode</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">prepend</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Serif CJK TC<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">edit</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">match</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">match</span> <span style="color: #715ab1; font-style: italic;">target</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">pattern</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">lang</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>ja<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>sans-serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">edit</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span> <span style="color: #715ab1; font-style: italic;">mode</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">prepend</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Sans CJK JP<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">edit</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">match</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">match</span> <span style="color: #715ab1; font-style: italic;">target</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">pattern</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">lang</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>ko<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>sans-serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">edit</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span> <span style="color: #715ab1; font-style: italic;">mode</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">prepend</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Sans CJK KR<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">edit</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">match</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">match</span> <span style="color: #715ab1; font-style: italic;">target</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">pattern</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">lang</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>zh-cn<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>sans-serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">edit</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span> <span style="color: #715ab1; font-style: italic;">mode</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">prepend</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Sans CJK SC<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">edit</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">match</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">match</span> <span style="color: #715ab1; font-style: italic;">target</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">pattern</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">lang</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>zh-tw<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>sans-serif<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">edit</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span> <span style="color: #715ab1; font-style: italic;">mode</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">prepend</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Sans CJK TC<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">edit</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">match</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">match</span> <span style="color: #715ab1; font-style: italic;">target</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">pattern</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">lang</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>ja<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>monospace<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">edit</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span> <span style="color: #715ab1; font-style: italic;">mode</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">prepend</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Sans Mono CJK JP<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">edit</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">match</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">match</span> <span style="color: #715ab1; font-style: italic;">target</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">pattern</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">lang</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>ko<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>monospace<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">edit</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span> <span style="color: #715ab1; font-style: italic;">mode</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">prepend</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Sans Mono CJK KR<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">edit</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">match</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">match</span> <span style="color: #715ab1; font-style: italic;">target</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">pattern</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">lang</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>zh-cn<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>monospace<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">edit</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span> <span style="color: #715ab1; font-style: italic;">mode</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">prepend</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Sans Mono CJK SC<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">edit</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">match</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">match</span> <span style="color: #715ab1; font-style: italic;">target</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">pattern</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">lang</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>zh-tw<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">test</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>monospace<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">test</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">edit</span> <span style="color: #715ab1; font-style: italic;">name</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">family</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span> <span style="color: #715ab1; font-style: italic;">mode</span><span style="color: #3a81c3; font-weight: bold;">=</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #2d9574;">prepend</span><span style="color: #2d9574; background-color: #fbf8ef;">"</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
      <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>Noto Sans Mono CJK TC<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">string</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
    <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">edit</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
  <span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">match</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
<span style="color: #655370; background-color: #fbf8ef;">&lt;</span><span style="color: #655370; background-color: #fbf8ef;">/</span><span style="color: #6c3163; font-weight: bold;">fontconfig</span><span style="color: #655370; background-color: #fbf8ef;">&gt;</span>
</pre>
</div></li>
</ul>

<p>
选取预设文件的时候看一下文件注释和内容去确定它是干什么的就好。我的感觉是很多预设都帮你选好了，你只需要看着添加一些／取消选择一些就好。
</p>
</div>
</div>
</div>
